src/bsl/Documents/гкс_ВыездНаКПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>гкс_ВыездНаКПП</Name>
			<BasedOn>
				<xr:Item>Document.гкс_ВъездНаКПП</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ВъездНаКПП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bsl/Documents/гкс_ВыездНаКПП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьДокументВыездНаКПП(ДокументОснование) Экспорт
	
	НовыйДокументВыездНаКПП = СоздатьДокумент();
	НовыйДокументВыездНаКПП.Дата				= ТекущаяДатаСеанса();
	НовыйДокументВыездНаКПП.ДокументОснование 	= ДокументОснование;
	НовыйДокументВыездНаКПП.ВремяВыезда			= ТекущаяДатаСеанса();
	
	Попытка
		НовыйДокументВыездНаКПП.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		
		ИнформацияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());	
		ТекстИсключения = НСтр("ru = 'Ошибка проведения документа'", ОбщегоНазначения.КодОсновногоЯзыка());
			
		ЗаписьЖурналаРегистрации(
			ТекстИсключения,
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.гкс_ВыездНаКПП, , ИнформацияОбОшибке);
	Конецпопытки;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
